app/Controllers/admin/Eventsseminar.php

SELECT *
FROM `lwm_events`
WHERE `is_deleted` = '0'
---
    public function index()
    {
        $data['page_title'] = 'Events & Seminars';
        $model = new EventModel();

        $data['total_events'] = $model->getTotalEvents();
        $data['total_completed_events'] = $model->getTotalCompletedEvents();
        $data['total_upcoming_events'] = $model->getTotalUpcomingEvents();

        if ($this->request->getMethod() === 'POST')
        {
                $searchData = [
                    'title'       => $this->request->getPost('title'),
                    'start_date' => $this->request->getPost('start_date'),
                    'end_date'   => $this->request->getPost('end_date'),
                ];
                $data['title'] = $searchData['title'];
                $data['start_date'] = $searchData['start_date'];
                $data['end_date'] = $searchData['end_date'];

                $data['events'] = $model->getFilteredEventCategories($searchData);
            } else {
                // Default load without filter
                $data['events'] = $model->where('is_deleted', '0')->findAll();

INSERT INTO `lwm_events` (`title`, `description`, `date`, `venue`, `poster_image`, `created_at`, `updated_at`) VALUES ('Vishwamitri River clean ', 'na', '2025-07-31T23:48', 'ajwa', '1754417955_d3a304368eccda5ff1e3.jpg', '2025-08-05 18:19:15', '2025-08-05 18:19:15')
---
    public function store()
    {
        $rules = [
            'title'       => 'required|min_length[3]|max_length[255]',
            'date'        => 'required|valid_date',
            'venue'       => 'required|max_length[255]',
            'poster_image' => [
                'label' => 'Poster Image',
                'rules' => 'uploaded[poster_image]|max_size[poster_image,5120]|is_image[poster_image]'
            ]
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $file = $this->request->getFile('poster_image');
        $newFileName = $file->getRandomName();
        $file->move(ROOTPATH . 'public/uploads/events', $newFileName);

        $model = new EventModel();
        $data = [
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'date'        => $this->request->getPost('date'),
            'venue'       => $this->request->getPost('venue'),
            'poster_image'=> $newFileName,
        ];

        if ($model->insert($data)) {

SELECT *
FROM `lwm_events`
WHERE `lwm_events`.`id` = '6'
---
    public function update($id)
    {
        $model = new EventModel();
        $event = $model->find($id);