app/Controllers/admin/Login.php

SELECT *
FROM `lwm_user`
WHERE `email` = 'admin@email.com'
 LIMIT 1
---
    public function auth()
    {

        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[5]',
        ];

        if (! $this->validate($rules)) {
            return view('admin/auth/login', [
                'validation' => $this->validator,
            ]);
        }

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('email',$email)->first();