app/Controllers/admin/User.php

SELECT *
FROM `lwm_user`
WHERE `id` = '1'
 LIMIT 1
---
    public function index()
    {
        $data['page_title'] = 'Profile';
        $model = new UserModel();
        $id = session()->get('user_id');
        $data['user'] = $model->where('id', $id)->first();