app/Controllers/admin/Wastecategory.php

	public function index()
{
    $data['page_title'] = 'Waste Categories';
    $model = new WasteModel();

    if ($this->request->getMethod() === 'POST')
	{
			$searchData = [
				'name'       => $this->request->getPost('name'),
				'start_date' => $this->request->getPost('start_date'),
				'end_date'   => $this->request->getPost('end_date'),
			];
			$data['name'] = $searchData['name'];
			$data['start_date'] = $searchData['start_date'];
			$data['end_date'] = $searchData['end_date'];

			$data['wastecategory'] = $model->getFilteredWasteCategories($searchData);
		} else {
			// Default load without filter
			$data['wastecategory'] = $model->where('is_deleted', '0')->findAll();
---
SELECT *
FROM `lwm_wasteCategories`
WHERE `is_deleted` = '0'