app/Models/ContactMessageModel.php

SELECT COUNT(*) AS `numrows`
FROM `lwm_contactmessages`
---
    public function getTotalMessages()
    {
        return $this->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lwm_contactmessages`
WHERE `status` = 'pending'
---
    public function getTotalPendingMessages()
    {
        return $this->where('status', 'pending')
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lwm_contactmessages`
WHERE `status` = 'new'
---
    public function getTotalNewMessages()
    {
        return $this->where('status', 'new')
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lwm_contactmessages`
WHERE `status` = 'done'
---
    public function getTotalDoneMessages()
    {
        return $this->where('status', 'done')
                    ->countAllResults();