app/Models/DashboardModel.php

SELECT COUNT(*) AS `numrows`
FROM `lwm_wastecategories`
WHERE `is_deleted` = '0'
---
    public function getTotalCategories()
    {
        return $this->db->table('lwm_wastecategories')
                        ->where('is_deleted', '0')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lwm_recyclingcenters`
WHERE `is_deleted` = '0'
---
    public function getTotalRecyclingCenters()
    {
        return $this->db->table('lwm_recyclingcenters')
                        ->where('is_deleted', '0')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lwm_events`
WHERE `is_deleted` = '0'
---
    public function getTotalEvents()
    {
        return $this->db->table('lwm_events')
                        ->where('is_deleted', '0')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `lwm_contactmessages`
WHERE `status` = 'unread'
---
    public function getTotalGetInTouchRequests()
    {
        return $this->db->table('lwm_contactmessages')
                        ->where('status', 'pending')
                        ->countAllResults();