app/Models/EventModel.php

    public function getTotalEvents()
    {
        return $this->where('is_deleted', '0')
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lwm_events`
WHERE `is_deleted` = '0'

    public function getTotalCompletedEvents()
    {
        return $this->where('date < NOW()')
                    ->where('is_deleted', '0')
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lwm_events`
WHERE `date` >= NOW()
AND `is_deleted` = '0'