app/Models/HomeModel.php

    public function getAllUpcomingEvents()
    {
        return $this->db->table('lwm_events')
                        ->where('date >= NOW()')
                        ->where('is_deleted', '0')
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `lwm_events`
WHERE `date` >= NOW()
AND `is_deleted` = '0'

    public function getAllRecyclingCenters()
    {
        return $this->db->table('lwm_recyclingcenters')
                        ->where('is_deleted', '0')
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `lwm_recyclingcenters`
WHERE `is_deleted` = '0'

    public function getAllCity()
    {
        return $this->db->table('lwm_recyclingcenters')
                        ->select('city')
                        ->where('is_deleted', '0')
                        ->distinct()
                        ->orderBy('city', 'ASC')
                        ->get()
                        ->getResultArray();
---
SELECT DISTINCT `city`
FROM `lwm_recyclingcenters`
WHERE `is_deleted` = '0'
ORDER BY `city` ASC

    public function getAllState()
    {
        return $this->db->table('lwm_recyclingcenters')
                        ->select('state')
                        ->where('is_deleted', '0')
                        ->distinct()
                        ->orderBy('state', 'ASC')
                        ->get()
                        ->getResultArray();
---
SELECT DISTINCT `state`
FROM `lwm_recyclingcenters`
WHERE `is_deleted` = '0'
ORDER BY `state` ASC

    public function getTotalCategories()
    {
        return $this->db->table('lwm_wastecategories')
                        ->where('is_deleted', '0')
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lwm_wastecategories`
WHERE `is_deleted` = '0'

    public function getTotalRecyclingCenters()
    {
        return $this->db->table('lwm_recyclingcenters')
                        ->where('is_deleted', '0')
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lwm_recyclingcenters`
WHERE `is_deleted` = '0'

    public function getTotalEvents()
    {
        return $this->db->table('lwm_events')
                        ->where('date <= NOW()')
                        ->where('is_deleted', '0')
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lwm_events`
WHERE `date` <= NOW()
AND `is_deleted` = '0'